# RebarShapeConstraintChordLength Properties

---
The RebarShapeConstraintChordLength type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from RebarShapeConstraint)
Top
#### Reference
RebarShapeConstraintChordLength Class
Autodesk.Revit.DB.Structure Namespace